{
"Medicinas":[
  {"id":"0","name":"Paracetamol ", "mecanismo":"Analgésico y antipirético. Inhibe la síntesis de prostaglandinas en el SNC y bloquea la generación del impulso doloroso a nivel periférico. Actúa sobre el centro hipotalámico regulador de la temperatura.", "indicaciones":"fiebre; dolor de cualquier etiología de intensidad leve o moderado", "admon":"Comprimido bucodispersable, solución oral, supositorio", "contra": "Hipersensibilidad a paracetamol, a clorhidrato de propacetamol.nsuficiencia hepatocelular grave. Hepatitis vírica"},
  {"id":"1","name":"Penicilina ", "mecanismo":"Bactericida. Bloquea la reparación y la síntesis de la pared bacteriana.", "indicaciones":"Infección respiratoria, urinaria, ORL, odontológica, ginecológica, digestiva, dermatológica, venérea, vascular central y periférica, profilaxis infecciosa en intervención quirúrgica.", "admon":"Comprimido bucodispersable", "contra": "Antecedente de alergia."},
  {"id":"2","name":"Pargeverina + clonixinato de lisina", "mecanismo":"Analgésico.", "indicaciones":"Analgésico en afecciones del aparato digestivo como: Síndrome espástico doloroso, esofágico, gástrico, pilórico y colitis. Afecciones de las vías biliares: Colitis hepática, colecistitis, síndrome poscolecistectomía. En urología ha demostrado su efectividad en cólicos renales y ureterales, cistitis y cistopielitis, litiasis renal o ureteral.", "admon":"oral, inyección", "contra": "Glaucoma, hipertrofia prostática, úlcera gastroduodenal activo, estenosis orgánica del píloro, embarazo, hipersensibilidad, hemorragia gastrointestinal."},
  {"id":"3","name":"Sulfametoxazol y trimetoprima", "mecanismo":"trimetoprima y sulfametoxazol bloquean dos etapas consecutivas en la biosíntesis de purinas y por lo tanto, ácidos nucleicos esenciales para muchas bacterias. Esta acción, produce una potenciación marcada de la actividad in vitro entre los dos agentes.", "indicaciones":"tratamiento y prevención de neumonía por P. carinii; profilaxis 1 ria de toxoplasmosis; nocardiosis; melioidosis. 2ª elección en: otitis media aguda; exacerbaciones agudas de bronquitis crónica en pacientes sin factores de riesgo; infecciones agudas no complicadas del tracto urinario (cistitis, pielonefritis); diarrea infecciosa; tratamiento de toxoplasmosis; granuloma inguinal (donovanosis); brucelosis.", "admon":"Vía oral:", "contra": "Antecedentes de hipersensibilidad a cualquiera de los principios activos "},
  {"id":"4","name":"Omeprazol ", "mecanismo":"Inhibe la secreción de ácido en el estómago. Se une a la bomba de protones en la célula parietal gástrica, inhibiendo el transporte final de H + al lumen gástrico.", "indicaciones":"Problemas de acidez estomacal, úlcera gástrica", "admon":"Debe administrarse preferentemente por las mañanas.", "contra": "Hipersensibilidad a omeprazol, benzimidazoles. Concomitancia con nelfinavir."},
  {"id":"5","name":"Loratadina", "mecanismo":"Antihistamínico tricíclico con actividad selectiva sobre receptores H1 periféricos.", "indicaciones":"Alivio sintomático y temporal de procesos alérgicos por polen, animales domésticos, polvo u otros agentes. Tto. sintomático de rinitis alérgica y urticaria idiopática crónica.", "admon":"Se puede tomar con independencia de las comidas.", "contra": "Hipersensibilidad."},
  {"id":"6","name":"ASPIRINA ", "mecanismo":"Analgésico y antipirético. Inhibe la síntesis de prostaglandinas, lo que impide la estimulación de los receptores del dolor por bradiquinina y otras sustancias. Efecto antiagregante plaquetario irreversible.", "indicaciones":"Tto. sintomático del dolor (de cabeza, dental, menstrual, muscular, lumbalgia). Fiebre. Tto. de la inflamación no reumática. Tto. de artritis reumatoide, artritis juvenil, osteoartritis y fiebre reumática.", "admon":"Vía oral. Tomar con las comidas o con leche, no con el estómago vacío", "contra": "úlcera gastroduodenal aguda, crónica o recurrente; molestias gástricas de repetición, antecedentes de hemorragia o perforación gástrica tras tto. con AAS o AINE; diátesis hemorrágica; historia de asma o asma inducida por salicilatos o medicamentos de acción similar; hipersensibilidad a salicilatos."},
  {"id":"7","name":"Metformina", "mecanismo":"La metformina es una biguanida con efectos antihiperglucemiantes, tanto en hiperglucemia postprandial como basal en plasma. No estimula la secreción de insulina, por lo que no provoca hipoglucemia", "indicaciones":"Diabetes mellitus tipo 2 en especial en pacientes con sobrepeso, cuando no logran control glucémico adecuado solo con dieta y ejercicio. En ads. en monoterapia o asociada con otros antidiabéticos orales, o con insulina. En niños ≥ 10 años y adolescentes en monoterapia o en combinación con insulina.", "admon":"Se puede administrar junto con o después de las comidas. Debe continuar su dieta con una distribución regular de la ingesta de carbohidratos durante el día. Si tiene sobrepeso, debe continuar con su dieta hipocalórica.", "contra": "Hipersensibilidad; cetoacidosis diabética, precoma diabético; I.R. (Clcr < 60 ml/min); patología aguda con riesgo de alteración renal: deshidratación, infección grave, shock; enf. aguda o crónica con riesgo de hipoxia tisular: insuf. cardiaca o respiratoria, infarto de miocardio reciente, shock; I.H., intoxicación alcohólica aguda, alcoholismo."},
  {"id":"8","name":"Naproxeno", "mecanismo":"Inhibe la prostaglandina sintetasa.", "indicaciones":"Tto. sintomático del dolor leve-moderado. Estados febriles. Artritis reumatoide, artritis reumatoide juvenil, osteoporosis, episodios agudos de gota, espondilitis anquilosante, síndromes reumatoides, dismenorrea, alteraciones musculoesqueléticas con dolor e inflamación. Tto. sintomático de crisis agudas de migraña. Menorragia 1 aria o 2 aria a un dispositivo intrauterino.", "admon":"Vía oral. Administrar enteros, con leche o comida, especialmente si se notan molestias digestivas.", "contra": "hipersensibilidad a naproxeno, antecedentes de reacciones alérgicas graves al AAS o a otros AINEs. Historial de o con asma, rinitis, urticarias, pólipos nasales, angioedema, colitis ulcerosa. I.H grave, I.R. grave. Niños < 2 años. Antecedentes de hemorragia gastrointestinal o perforación"},
  {"id":"9","name":"Captopril", "mecanismo":"Inhibidor competitivo, altamente selectivo del ECA da lugar a concentraciones reducidas de angiotensina II, que conduce a disminución de la actividad vasopresora y secreción reducida de aldosterona.", "indicaciones":"Hipertensión, Insuficiencia cardiaca, Infarto de miocardio, Nefropatía diabética tipo I", "admon":"Vía oral. Administrar antes, durante y después de las comidas.", "contra": "Hipersensibilidad a captopril o a otro IECA. Antecedentes de angioedema asociado a un tratamiento previo a IECA. Edema angioneurótico hereditario/idiopático. 2º y 3 er trimestre del embarazo. Uso concomitante con aliskireno en pacientes con diabetes mellitus o I.R. de moderada a grave."}
  
  ]
}